---
type: TransactWithCentralOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# TransactWithCentralOptions

`Autodesk.Revit.DB.TransactWithCentralOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | TransactWithCentralOptions | 2014 | `public TransactWithCentralOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetLockCallback | 2014 | `public ICentralLockedCallback GetLockCallback ()` |
| Method | SetLockCallback | 2014 | `public void SetLockCallback ( ICentralLockedCallback lockCallback )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |